# Neeps - Resit

In [1]:
import getpass
import psycopg2
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
pwd = getpass.getpass()
engine = create_engine(
    'postgresql+psycopg2://postgres:%s@192.168.31.31:15432/sqlzoo' % (pwd))
pd.set_option('display.max_rows', 60)

········

In [2]:
ut_staff = pd.read_sql_table('ut_staff', engine)
ut_student = pd.read_sql_table('ut_student', engine)
ut_event = pd.read_sql_table('ut_event', engine)
ut_room = pd.read_sql_table('ut_room', engine)
ut_attends = pd.read_sql_table('ut_attends', engine)
ut_teaches = pd.read_sql_table('ut_teaches', engine)
ut_occurs = pd.read_sql_table('ut_occurs', engine)
ut_modle = pd.read_sql_table('ut_modle', engine)
ut_week = pd.read_sql_table('ut_week', engine)

## 1.
**Give the day and the time of the event co72002.L01.**

In [3]:
ut_event.loc[ut_event['id']=='co72002.L01', ['dow', 'tod']]

        dow    tod
112  Monday  10:00

## 2.
**For each event in module co72003 show the day, the time and the place.**

In [4]:
ut_event.loc[ut_event['modle']=='co72003', ['id', 'dow', 'tod', 'room']]

              id     dow    tod    room
114  co72003.L01  Monday  14:00  cr.B12

## 3.
**List the id of the events taught by 'Chisholm, Ken'.**

In [5]:
(ut_event.rename(columns={'id': 'event'})
 .merge(ut_teaches, on='event')
 .merge(ut_staff.loc[ut_staff['name']=='Chisholm, Ken']
        .rename(columns={'id': 'staff'}), on='staff')
 [['event']])

         event
0  co22006.L01
1  co22006.L02
2  co22006.L03
3  co22006.T01
4  co22006.T02
5  co72013.L01
6  co72013.L02
7  co72013.T01
8  co72013.T02
9  co72013.T06

## 4.
**List the staff who teach in cr.SMH.**

In [6]:
(ut_staff.rename(columns={'id': 'staff'})
 .merge(ut_teaches, on='staff')
 .merge(ut_event.loc[ut_event['room']=='cr.SMH']
        .rename(columns={'id': 'event'}), on='event')
 [['name']].drop_duplicates().sort_values('name'))

                  name
19        Barclay, Ken
1        Chisholm, Ken
0      Cumming, Andrew
10        Greig, Frank
13       Hastie, Colin
8         Jackson, Jim
5          Kemmer, Rob
2     Lawson, Alistair
14  Macaulay, Catriona
4      Maclean, Aileen
15         McEwan, Tom
6     Middleton, Steve
18          Smith, Ian
21      Smyth, Michael
7     Soutar, Alastair
17       Turner, Susan

## 5.
**Show the total number of hours (over the whole semester) of classes for com.IS.a**

In [7]:
a = (ut_event.rename(columns={'id': 'event'})
 .merge(ut_occurs, on='event')
 .merge(ut_attends.loc[ut_attends['student']=='com.IS.a'], on='event')
 ['duration'].sum())
pd.DataFrame({'hrs': [a]})

   hrs
0   60